In [1]:
import numpy as np 
import pandas as pd 
from tqdm import tqdm
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split

In [2]:
df=pd.read_csv("C:\\Users\\Anjali Kumari\\OneDrive\\Desktop\\bank+marketing\\bank\\bank.csv")

In [3]:
df.head()

  age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0  30;"unemployed";"married";"primary";"no";1787;...
1  33;"services";"married";"secondary";"no";4789;...
2  35;"management";"single";"tertiary";"no";1350;...
3  30;"management";"married";"tertiary";"no";1476...
4  59;"blue-collar";"married";"secondary";"no";0;...

In [4]:
df.columns

Index(['age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"'], dtype='object')

In [5]:
df.info

<bound method DataFrame.info of      age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0     30;"unemployed";"married";"primary";"no";1787;...
1     33;"services";"married";"secondary";"no";4789;...
2     35;"management";"single";"tertiary";"no";1350;...
3     30;"management";"married";"tertiary";"no";1476...
4     59;"blue-collar";"married";"secondary";"no";0;...
...                                                 ...
4516  33;"services";"married";"secondary";"no";-333;...
4517  57;"self-employed";"married";"tertiary";"yes";...
4518  57;"technician";"married";"secondary";"no";295...
4519  28;"blue-collar";"married";"secondary";"no";11...
4520  44;"entrepreneur";"single";"tertiary";"no";113...

[4521 rows x 1 columns]>

In [6]:
df.describe()

       age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
count                                                4521
unique                                               4521
top     30;"unemployed";"married";"primary";"no";1787;...
freq                                                    1

In [7]:
df.isnull().sum()

age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"    0
dtype: int64

In [8]:
corr = df.corr()
corr

Empty DataFrame
Columns: []
Index: []

In [9]:
df1=pd.read_csv("C:\\Users\\Anjali Kumari\\OneDrive\\Desktop\\bank-full-correct.csv")

In [10]:
df1.info

<bound method DataFrame.info of        age           job   marital  education default  balance housing loan  \
0       58    management   married   tertiary      no     2143     yes   no
1       44    technician    single  secondary      no       29     yes   no
2       33  entrepreneur   married  secondary      no        2     yes  yes
3       47   blue-collar   married    unknown      no     1506     yes   no
4       33       unknown    single    unknown      no        1      no   no
...    ...           ...       ...        ...     ...      ...     ...  ...
45206   51    technician   married   tertiary      no      825      no   no
45207   71       retired  divorced    primary      no     1729      no   no
45208   72       retired   married  secondary      no     5715      no   no
45209   57   blue-collar   married  secondary      no      668      no   no
45210   37  entrepreneur   married  secondary      no     2971      no   no

         contact  day month  duration  campaign  pdays  previous poutcome    y
0        unknown    5   may       261         1     -1         0  unknown   no
1        unknown    5   may       151         1     -1         0  unknown   no
2        unknown    5   may        76         1     -1         0  unknown   no
3        unknown    5   may        92         1     -1         0  unknown   no
4        unknown    5   may       198         1     -1         0  unknown   no
...          ...  ...   ...       ...       ...    ...       ...      ...  ...
45206   cellular   17   nov       977         3     -1         0  unknown  yes
45207   cellular   17   nov       456         2     -1         0  unknown  yes
45208   cellular   17   nov      1127         5    184         3  success  yes
45209  telephone   17   nov       508         4     -1         0  unknown   no
45210   cellular   17   nov       361         2    188        11    other   no

[45211 rows x 17 columns]>

In [11]:
df1.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [12]:
print(f'Shape of dataset: {df1.shape}')

Shape of dataset: (45211, 17)

In [13]:
print(f'Columns in the dataset: {list(df1.columns)}')

Columns in the dataset: ['age', 'job', 'marital', 'education', 'default', 'balance', 'housing', 'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays', 'previous', 'poutcome', 'y']

In [14]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45211 non-null  int64
 1   job        45211 non-null  object
 2   marital    45211 non-null  object
 3   education  45211 non-null  object
 4   default    45211 non-null  object
 5   balance    45211 non-null  int64
 6   housing    45211 non-null  object
 7   loan       45211 non-null  object
 8   contact    45211 non-null  object
 9   day        45211 non-null  int64
 10  month      45211 non-null  object
 11  duration   45211 non-null  int64
 12  campaign   45211 non-null  int64
 13  pdays      45211 non-null  int64
 14  previous   45211 non-null  int64
 15  poutcome   45211 non-null  object
 16  y          45211 non-null  object
dtypes: int64(7), object(10)
memory usage: 5.9+ MB

In [15]:
print(f'Number of duplicates : {df1.duplicated().sum()}')

Number of duplicates : 0

In [16]:
df1[df1.duplicated() == True]

Empty DataFrame
Columns: [age, job, marital, education, default, balance, housing, loan, contact, day, month, duration, campaign, pdays, previous, poutcome, y]
Index: []

In [17]:
df1 = df1.drop_duplicates()

In [18]:
print(f'Shape of dataset after dropping duplicates: {df1.shape}')

Shape of dataset after dropping duplicates: (45211, 17)

In [19]:
for i in df1.columns:
    print(f'Value counts in {i} are: \n{df1[i].value_counts()}')
    print('*'*100)

Value counts in age are:
32    2085
31    1996
33    1972
34    1930
35    1894
      ...
93       2
90       2
95       2
88       2
94       1
Name: age, Length: 77, dtype: int64
****************************************************************************************************
Value counts in job are:
blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: job, dtype: int64
****************************************************************************************************
Value counts in marital are:
married     27214
single      12790
divorced     5207
Name: marital, dtype: int64
****************************************************************************************************
Value counts in education are:
secondary    23202
tertiary     13301
primary       6851
unknown       1857
Name: education, dtype: int64
****************************************************************************************************
Value counts in default are:
no     44396
yes      815
Name: default, dtype: int64
****************************************************************************************************
Value counts in balance are:
 0        3514
 1         195
 2         156
 4         139
 3         134
          ...
-381         1
 4617        1
 20584       1
 4358        1
 16353       1
Name: balance, Length: 7168, dtype: int64
****************************************************************************************************
Value counts in housing are:
yes    25130
no     20081
Name: housing, dtype: int64
****************************************************************************************************
Value counts in loan are:
no     37967
yes     7244
Name: loan, dtype: int64
****************************************************************************************************
Value counts in contact are:
cellular     29285
unknown      13020
telephone     2906
Name: contact, dtype: int64
****************************************************************************************************
Value counts in day are:
20    2752
18    2308
21    2026
17    1939
6     1932
5     1910
14    1848
8     1842
28    1830
7     1817
19    1757
29    1745
15    1703
12    1603
13    1585
30    1566
9     1561
11    1479
4     1445
16    1415
2     1293
27    1121
3     1079
26    1035
23     939
22     905
25     840
31     643
10     524
24     447
1      322
Name: day, dtype: int64
****************************************************************************************************
Value counts in month are:
may    13766
jul     6895
aug     6247
jun     5341
nov     3970
apr     2932
feb     2649
jan     1403
oct      738
sep      579
mar      477
dec      214
Name: month, dtype: int64
****************************************************************************************************
Value counts in duration are:
124     188
90      184
89      177
104     175
122     175
       ...
1833      1
1545      1
1352      1
1342      1
1556      1
Name: duration, Length: 1573, dtype: int64
****************************************************************************************************
Value counts in campaign are:
1     17544
2     12505
3      5521
4      3522
5      1764
6      1291
7       735
8       540
9       327
10      266
11      201
12      155
13      133
14       93
15       84
16       79
17       69
18       51
19       44
20       43
21       35
22       23
25       22
23       22
24       20
29       16
28       16
26       13
31       12
27       10
32        9
30        8
33        6
34        5
36        4
35        4
43        3
38        3
37        2
50        2
41        2
46        1
58        1
55        1
63        1
51        1
39        1
44        1
Name: campaign, dtype: int64
****************************************************************************************************
Value counts in pdays are:
-1      36954
 182      167
 92       147
 91       126
 183      126
        ...
 449        1
 452        1
 648        1
 595        1
 530        1
Name: pdays, Length: 559, dtype: int64
****************************************************************************************************
Value counts in previous are:
0      36954
1       2772
2       2106
3       1142
4        714
5        459
6        277
7        205
8        129
9         92
10        67
11        65
12        44
13        38
15        20
14        19
17        15
16        13
19        11
20         8
23         8
18         6
22         6
24         5
27         5
21         4
29         4
25         4
30         3
38         2
37         2
26         2
28         2
51         1
275        1
58         1
32         1
40         1
55         1
35         1
41         1
Name: previous, dtype: int64
****************************************************************************************************
Value counts in poutcome are:
unknown    36959
failure     4901
other       1840
success     1511
Name: poutcome, dtype: int64
****************************************************************************************************
Value counts in y are:
no     39922
yes     5289
Name: y, dtype: int64
****************************************************************************************************

In [20]:
for i in df1.columns:
    print(f'No of unique value in {i} is: {df1[i].nunique()}')

No of unique value in age is: 77
No of unique value in job is: 12
No of unique value in marital is: 3
No of unique value in education is: 4
No of unique value in default is: 2
No of unique value in balance is: 7168
No of unique value in housing is: 2
No of unique value in loan is: 2
No of unique value in contact is: 3
No of unique value in day is: 31
No of unique value in month is: 12
No of unique value in duration is: 1573
No of unique value in campaign is: 48
No of unique value in pdays is: 559
No of unique value in previous is: 41
No of unique value in poutcome is: 4
No of unique value in y is: 2

In [21]:
for i in df1.columns:
    print(f'Unique values in {i} are: \n{df1[i].unique()}')
    print('*'*100)

Unique values in age are:
[58 44 33 47 35 28 42 43 41 29 53 57 51 45 60 56 32 25 40 39 52 46 36 49
 59 37 50 54 55 48 24 38 31 30 27 34 23 26 61 22 21 20 66 62 83 75 67 70
 65 68 64 69 72 71 19 76 85 63 90 82 73 74 78 80 94 79 77 86 95 81 18 89
 84 87 92 93 88]
****************************************************************************************************
Unique values in job are:
['management' 'technician' 'entrepreneur' 'blue-collar' 'unknown'
 'retired' 'admin.' 'services' 'self-employed' 'unemployed' 'housemaid'
 'student']
****************************************************************************************************
Unique values in marital are:
['married' 'single' 'divorced']
****************************************************************************************************
Unique values in education are:
['tertiary' 'secondary' 'unknown' 'primary']
****************************************************************************************************
Unique values in default are:
['no' 'yes']
****************************************************************************************************
Unique values in balance are:
[ 2143    29     2 ...  8205 14204 16353]
****************************************************************************************************
Unique values in housing are:
['yes' 'no']
****************************************************************************************************
Unique values in loan are:
['no' 'yes']
****************************************************************************************************
Unique values in contact are:
['unknown' 'cellular' 'telephone']
****************************************************************************************************
Unique values in day are:
[ 5  6  7  8  9 12 13 14 15 16 19 20 21 23 26 27 28 29 30  2  3  4 11 17
 18 24 25  1 10 22 31]
****************************************************************************************************
Unique values in month are:
['may' 'jun' 'jul' 'aug' 'oct' 'nov' 'dec' 'jan' 'feb' 'mar' 'apr' 'sep']
****************************************************************************************************
Unique values in duration are:
[ 261  151   76 ... 1298 1246 1556]
****************************************************************************************************
Unique values in campaign are:
[ 1  2  3  5  4  6  7  8  9 10 11 12 13 19 14 24 16 32 18 22 15 17 25 21
 43 51 63 41 26 28 55 50 38 23 20 29 31 37 30 46 27 58 33 35 34 36 39 44]
****************************************************************************************************
Unique values in pdays are:
[ -1 151 166  91  86 143 147  89 140 176 101 174 170 167 195 165 129 188
 196 172 118 119 104 171 117 164 132 131 123 159 186 111 115 116 173 178
 110 152  96 103 150 175 193 181 185 154 145 138 126 180 109 158 168  97
 182 127 130 194 125 105 102  26 179  28 183 155 112 120 137 124 187 190
 113 162 134 169 189   8 144 191 184 177   5  99 133  93  92  10 100 156
 198 106 153 146 128   7 121 160 107  90  27 197 136 139 122 157 149 135
  30 114  98 192 163  34  95 141  31 199  94 108  29 268 247 253 226 244
 239 245 204 231 238 258 230 254 265  71 223 246 250 266 240 205 261 259
 241 260 234 251 225 161 237 262 248 255 220 227 206 224 249 235 228 263
   2 270 232 252 207 200 269 233 256 273 272 242 264 208 214 222 271 203
 221 202 216 201 257 229 210 217  75 213  73  76 267 211 215  77 236  82
   6 209 274   1 243 212 275  80 276   9 279  12 280  88 277  85  84 219
  24  21 282  41 294  49 329 307 303 331 308 300  64 314 287 330 332 302
 323 318 333  60 326 335 313 312 305 325 327 336 309 328 322  39 316 292
 295 310 306 320 317 289  57 321 142 339 301 315 337 334 340 319  17  74
 148 341 299 344 342 324 345 346 304 281 343 338  14 347  15 291 348 349
 285 350 284  25 283 278  81   4  87  83  79  70  13 293  37  78  63  22
 296 355  66  19  35 360 357 354 351 362 358 365 298 286 364 363  47 361
 288 366 356 352 359 297 367 353 368  42 290  67 371 370 369  50  36 373
 374 372 311 375 378  59 379  40  18  43  20  69  38 385  56  55  44 391
  72 390  32  62 399 393  65 377 395 388 389 386  61 412 405 434 394 382
 459 440 397 383  68 461 462 463 422  51 457 430 442 403 454 428 392 410
 401 474 475 477 478  54 476 380 479  45  46 495  58  48 518  52 515 520
 511 536 387 218  33 544 435 436 555 433 446 558 469 616 561 553 384 592
 467 585 480 421 667 626 426 595 381 376 648 521 452 449 633 398  53 460
 670 551 414 557 687 404 651 686 425 504 578 674 416 586 411 756 450 745
 514 417 424 776 396 683 529 439 415 456 407 458 532 481 791 701 531 792
 413 445 535 784 419 455 491 431 542 470 472 717 437   3 782 728 828 524
 562 761 492 775 579 493 464 760 466 465 656 831 490 432 655 427 749 838
 769 587 778 854 779 850 771 594 842 589 603 484 489 486 409 444 680 808
 485 503 690 772 774 526 420 528 500 826 804 508 547 805 541 543 871 550
 530]
****************************************************************************************************
Unique values in previous are:
[  0   3   1   4   2  11  16   6   5  10  12   7  18   9  21   8  14  15
  26  37  13  25  20  27  17  23  38  29  24  51 275  22  19  30  58  28
  32  40  55  35  41]
****************************************************************************************************
Unique values in poutcome are:
['unknown' 'failure' 'other' 'success']
****************************************************************************************************
Unique values in y are:
['no' 'yes']
****************************************************************************************************

In [22]:
df1.describe(include='O')

,job,marital,education,default,housing,loan,contact,month,poutcome,y
count,45211,45211,45211,45211,45211,45211,45211,45211,45211,45211
unique,12,3,4,2,2,2,3,12,4,2
top,blue-collar,married,secondary,no,yes,no,cellular,may,unknown,no
freq,9732,27214,23202,44396,25130,37967,29285,13766,36959,39922

In [23]:
df1.describe().T

,count,mean,std,min,25%,50%,75%,max
age,45211.0,40.936210,10.618762,18.0,33.0,39.0,48.0,95.0
balance,45211.0,1362.272058,3044.765829,-8019.0,72.0,448.0,1428.0,102127.0
day,45211.0,15.806419,8.322476,1.0,8.0,16.0,21.0,31.0
duration,45211.0,258.163080,257.527812,0.0,103.0,180.0,319.0,4918.0
campaign,45211.0,2.763841,3.098021,1.0,1.0,2.0,3.0,63.0
pdays,45211.0,40.197828,100.128746,-1.0,-1.0,-1.0,-1.0,871.0
previous,45211.0,0.580323,2.303441,0.0,0.0,0.0,0.0,275.0

In [34]:
df1 = df1.copy()
df1.head()

  age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0  30;"unemployed";"married";"primary";"no";1787;...
1  33;"services";"married";"secondary";"no";4789;...
2  35;"management";"single";"tertiary";"no";1350;...
3  30;"management";"married";"tertiary";"no";1476...
4  59;"blue-collar";"married";"secondary";"no";0;...

In [35]:
import seaborn as sns
import matplotlib.pyplot as plt

print("Columns in df2:", df2.columns)

if 'age' in df2.columns:
    plt.figure(figsize=(15, 5))
    sns.histplot(data=df2, x='age', kde=True, color='tab:green', bins=20)
    plt.title('Distribution of Age')
    plt.show()
else:
    print("Error: 'age' column not found in df2")

Columns in df2: Index(['age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"'], dtype='object')
Error: 'age' column not found in df2

In [39]:
import pandas as pd

df1tObject = df1.select_dtypes(include=['object'])  # Object columns
dftNumeric = df1.select_dtypes(include=['number'])  # Numeric columns

# Concatenate the two DataFrames along columns (axis=1)
df1_Final = pd.concat([df1tObject, dftNumeric], axis=1)

# Display the final DataFrame
print(df1_Final.head())

  age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0  30;"unemployed";"married";"primary";"no";1787;...
1  33;"services";"married";"secondary";"no";4789;...
2  35;"management";"single";"tertiary";"no";1350;...
3  30;"management";"married";"tertiary";"no";1476...
4  59;"blue-collar";"married";"secondary";"no";0;...

In [42]:
import pandas as pd
from sklearn.neighbors import LocalOutlierFactor
from sklearn.preprocessing import LabelEncoder

df_categorical = df1_Final.select_dtypes(include=['object'])
df_numeric = df1_Final.select_dtypes(include=['number'])

label_encoders = {}
for col in df_categorical.columns:
    le = LabelEncoder()
    df_categorical[col] = le.fit_transform(df_categorical[col])
    label_encoders[col] = le  
df_encoded = pd.concat([df_categorical, df_numeric], axis=1)

clf = LocalOutlierFactor()
y_pred = clf.fit_predict(df_encoded)

print(y_pred)

[1 1 1 ... 1 1 1]

In [43]:
x_score = clf.negative_outlier_factor_
outlier_score = pd.DataFrame()
outlier_score["score"] = x_score

#threshold
threshold2 = -1.5
filtre2 = outlier_score["score"] < threshold2
outlier_index = outlier_score[filtre2].index.tolist()

In [44]:
len(outlier_index)

0

In [45]:
df1_Final.drop(outlier_index, inplace=True)

In [48]:
import seaborn as sns
import matplotlib.pyplot as plt

if not df1_Final.empty and df1_Final.select_dtypes(include=['number']).shape[1] > 0:
    # Compute the correlation matrix
    corr_matrix = df1_Final.corr()

    # Plot the heatmap
    f, ax = plt.subplots(figsize=(12, 8))
    sns.heatmap(corr_matrix, cmap="PuBu", annot=True, linewidths=0.5, fmt='.2f', ax=ax)
    plt.show()
else:
    print("Error: The DataFrame is either empty or contains no numeric columns for correlation.")

Error: The DataFrame is either empty or contains no numeric columns for correlation.

In [53]:
print(df1.columns)

Index(['age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"'], dtype='object')

In [57]:
import missingno as msno 
msno.matrix(df1)

ModuleNotFoundError: No module named 'missingno'